---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveUV
source: html/fdce0929-e0e4-4637-2c73-fb84c4bef7cf.htm
---
# CurveUV Members

Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.